; domain
(define (domain Ricochet-Robots)
	(:requirements :strips :typing :action-costs :equality)

	(:types 
		robot		; Robot que se desplaza en el tablero
		casilla		; Casilla del tablero
		color		; Colores que tienen los robots, las casillas objetivo y las barreras mágicas
		orientacion
		direccion
		)

	(:constants
		slash backslash - orientacion
		left up right down stop - direccion	; Tanto la adyacencia de las casillas como el movimiento de un robot tiene una dirección
		)

	(:predicates 
		(at ?x - robot ?y - casilla) 				; Un robot está en una casilla
		(colorRobot ?x - robot ?y - color)			; Un robot tiene un color asignado
		(moviendo ?x - robot ?y - direccion)		; Un robot puede moverse, y cuando se detenga, su movimiento será stop
		(movimientoEnCurso ?x - direccion)			; Necesario para controlar que el robot que ha empezado a moverse se mueva 
		(free ?x - casilla)							; No hay robots en la casilla
		(adyacente ?x - casilla ?y - casilla ?z - direccion)	; Dos casillas son adyacentes si existe una dirección que las comunique
		(hasBarrier ?x - casilla)					; Es necesario un predicado para indicar la mera existencia de una barrera en una casilla
		(barraMagica ?x - casilla ?y - color ?z - orientacion)	; Las barreras Mágicas modifican el movimiento de los robots segun los solores y si son / (slash) o \ (backslash)
		(casillaObjetivo ?x - casilla ?y - color)	; Una casilla puede ser casillaObjetivo y debe tener un color asignado
		)

	(:functions
		(total-cost)								; Movimientos realizados, necesitamos ir contando los total-cost realizados
		)


	(:action MoverACasillaLibre	; El robot comienza su movimiento en una dirección válida
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			)
		:precondition (and
			(movimientoEnCurso stop)	; Solo se puede mover un robot cuando no hay movimiento en curso
			(at ?robot ?casillaOrigen)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			(moviendo ?robot ?direccion)
			(not (movimientoEnCurso stop))
			(movimientoEnCurso ?direccion)
			(increase (total-cost) 1)
			)
		)

	(:action LetItGo	; Cuando nada impide el movimiento, el robot se mueve siguiendo la dirección
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			(or 
				(not (hasBarrier ?casillaOrigen))
				(or 
					(barraMagica ?casillaOrigen ?color slash)
					(barraMagica ?casillaOrigen ?color backslash)
					)
				)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			)
		)


	(:action StopMiHada	; Cuando un robot o una pared se encuentra en el camino del robot en movimiento, este se para
		:parameters (?robot - robot
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion) ; Las paredes se representan como una dirección con la misma casilla origen y destino
			(not (hasBarrier ?casillaOrigen))	; Si la casilla de origen, que es en la que se termina el movimiento, tiene una barrera mágica, el movimiento no se puede terminar
			(or
				(and 		; Hay un robot
					(not (= ?casillaOrigen ?casillaDestino))
					(not (free ?casillaDestino))
					)
				(and 		; Hay una pared
					(= ?casillaOrigen ?casillaDestino)
					)
				)
			)
		:effect	(and
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso stop)
			(not (moviendo ?robot ?direccion))
			)
		)

	(:action ToLeft	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia la izquierda
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por arriba
					(= ?direccion down)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				(and	; El robot llega por abajo
					(= ?direccion up)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino left)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot left)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso left)
			)
		)

	(:action ToHeaven	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia arriba
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por la derecha
					(= ?direccion left)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por la izquierda
					(= ?direccion right)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino up)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot up)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso up)
			)
		)

	(:action ToRight	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia abajo
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por arriba
					(= ?direccion down)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por abajo
					(= ?direccion up)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino right)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot right)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso right)
			)
		)

	(:action ToHell	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia abajo
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por la izquierda
					(= ?direccion right)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por la derecha
					(= ?direccion left)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino down)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot down)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso down)
			)
		)

	)

; problem
(define (problem pRR-1)
	(:domain Ricochet-Robots)

	(:objects
		robotRojo - robot
		robotAmarillo - robot
		rojo - color
		amarillo - color
		A1 - casilla
		A2 - casilla
		A3 - casilla
		A4 - casilla
		B1 - casilla
		B2 - casilla
		B3 - casilla
		B4 - casilla
		C1 - casilla
		C2 - casilla
		C3 - casilla
		C4 - casilla
		D1 - casilla
		D2 - casilla
		D3 - casilla
		D4 - casilla
		)

	(:init
		; Bots
		(colorRobot robotRojo rojo)
		(colorRobot robotAmarillo amarillo)
		(at robotRojo D4)
		(at robotAmarillo A3)
		(movimientoEnCurso stop)
		(= (total-cost) 0)
		; Casillas
		(free A1)
		(free A2)
		(free A4)
		(free B1)
		(free B2)
		(free B3)
		(free B4)
		(free C1)
		(free C2)
		(free C3)
		(free C4)
		(free D1)
		(free D2)
		(free D3)
		; Casillas objetivo
		(casillaObjetivo D3 rojo)
		; Casillas Adyacentes (adyacente ?x - casilla ?y - casilla ?z - direccion) left up right down stop
		(adyacente A1 A1 left)
		(adyacente A1 A1 up)
		(adyacente A1 A1 right) ; Pared A1 - A2
		(adyacente A1 B1 down)
		(adyacente A2 A2 left)	; Pared A1 - A2
		(adyacente A2 A2 up)
		(adyacente A2 A3 right)
		(adyacente A2 B2 down)
		(adyacente A3 A2 left)
		(adyacente A3 A3 up)
		(adyacente A3 A4 right)
		(adyacente A3 B3 down)
		(adyacente A4 A3 left)
		(adyacente A4 A4 up)
		(adyacente A4 A4 right)
		(adyacente A4 B4 down)
		(adyacente B1 B1 left)
		(adyacente B1 A1 up)
		(adyacente B1 B2 right)
		(adyacente B1 C1 down)
		(adyacente B2 B1 left)
		(adyacente B2 A2 up)
		(adyacente B2 B3 right)
		(adyacente B2 C2 down)
		(adyacente B3 B2 left)
		(adyacente B3 A3 up)
		(adyacente B3 B4 right)
		(adyacente B3 C3 down)
		(adyacente B4 B3 left)
		(adyacente B4 A4 up)
		(adyacente B4 B4 right)
		(adyacente B4 C4 down)
		(adyacente C1 C1 left)
		(adyacente C1 B1 up)
		(adyacente C1 C2 right)
		(adyacente C1 D1 down)
		(adyacente C2 C1 left)
		(adyacente C2 B2 up)
		(adyacente C2 C3 right)
		(adyacente C2 D2 down)
		(adyacente C3 C2 left)
		(adyacente C3 B3 up)
		(adyacente C3 C4 right)
		(adyacente C3 D3 down)
		(adyacente C4 C3 left)
		(adyacente C4 B4 up)
		(adyacente C4 C4 right)
		(adyacente C4 D4 down)
		(adyacente D1 D1 left)
		(adyacente D1 C1 up)
		(adyacente D1 D2 right)
		(adyacente D1 D1 down)
		(adyacente D2 D1 left)
		(adyacente D2 C2 up)
		(adyacente D2 D3 right)
		(adyacente D2 D2 down)
		(adyacente D3 D2 left)
		(adyacente D3 C3 up)
		(adyacente D3 D4 right)
		(adyacente D3 D3 down)
		(adyacente D4 D3 left)
		(adyacente D4 C4 up)
		(adyacente D4 D4 right)
		(adyacente D4 D4 down)
		)

	(:goal (and
		(at robotRojo D3)
		(movimientoEnCurso stop)
		)
	)

	(:metric minimize (total-cost))

)

; plan
1. (moveracasillalibre robotamarillo a3 a2 left)
   deleted: (at robotamarillo a3) (free a2) (movimientoencurso stop)
   added: (free a3) (at robotamarillo a2) (moviendo robotamarillo left) (movimientoencurso left)
   goals met: 0 of 2
2. (stopmihada robotamarillo a2 a2 left)
   deleted: (movimientoencurso left) (moviendo robotamarillo left)
   added: (movimientoencurso stop)
   goals met: 1 of 2
3. (moveracasillalibre robotamarillo a2 b2 down)
   deleted: (at robotamarillo a2) (free b2) (movimientoencurso stop)
   added: (free a2) (at robotamarillo b2) (moviendo robotamarillo down) (movimientoencurso down)
   goals met: 0 of 2
4. (letitgo robotamarillo b2 c2 down amarillo)
   deleted: (at robotamarillo b2) (free c2)
   added: (free b2) (at robotamarillo c2)
   goals met: 0 of 2
5. (letitgo robotamarillo c2 d2 down amarillo)
   deleted: (at robotamarillo c2) (free d2)
   added: (free c2) (at robotamarillo d2)
   goals met: 0 of 2
6. (stopmihada robotamarillo d2 d2 down)
   deleted: (movimientoencurso down) (moviendo robotamarillo down)
   added: (movimientoencurso stop)
   goals met: 1 of 2
7. (moveracasillalibre robotrojo d4 d3 left)
   deleted: (at robotrojo d4) (free d3) (movimientoencurso stop)
   added: (free d4) (at robotrojo d3) (moviendo robotrojo left) (movimientoencurso left)
   goals met: 1 of 2
8. (stopmihada robotrojo d3 d2 left)
   deleted: (movimientoencurso left) (moviendo robotrojo left)
   added: (movimientoencurso stop)
   goals met: 2 of 2
